{"entries":[{"skip_index":true,"title":"Search results","url":"/search/","tags":[],"body":""},{"title":"Accessibility/Section 508","url":"/accessibility-section508/","tags":[],"body":""},{"title":"Agile Development","url":"/agile/","tags":[],"body":""},{"title":"Future Topics","url":"/future-topics/","tags":[],"body":""},{"title":"Future Topic!","url":"/future-topics/analytics/","tags":[],"body":""},{"title":"Future Topic!","url":"/future-topics/copyright/","tags":[],"body":""},{"title":"Future Topic!","url":"/future-topics/customerservice/","tags":[],"body":""},{"title":"Future Topic!","url":"/future-topics/design-standards/","tags":[],"body":""},{"title":"Future Topic!","url":"/future-topics/domains-and-branding/","tags":[],"body":""},{"title":"Future Topic!","url":"/future-topics/governance/","tags":[],"body":""},{"title":"Future Topic!","url":"/future-topics/information-quality/","tags":[],"body":""},{"title":"Future Topic!","url":"/future-topics/mandatory-content/","tags":[],"body":""},{"title":"Future Topic!","url":"/future-topics/mobile-device-agnostic/","tags":[],"body":""},{"title":"Future Topic!","url":"/future-topics/multilingual-websites/","tags":[],"body":""},{"title":"Future Topic!","url":"/future-topics/open-government-data-content/","tags":[],"body":""},{"title":"Future Topic!","url":"/future-topics/plain-writing/","tags":[],"body":""},{"title":"Future Topic!","url":"/future-topics/privacy-and-identity-management/","tags":[],"body":""},{"title":"Future Topic!","url":"/future-topics/prohibition-on-advertising/","tags":[],"body":""},{"title":"Future Topic!","url":"/future-topics/records-management/","tags":[],"body":""},{"title":"Future Topic!","url":"/future-topics/search/","tags":[],"body":""},{"title":"Future Topic!","url":"/future-topics/technology-standards/","tags":[],"body":""},{"title":"Introduction","url":"/","tags":[],"body":"Use this template to create 18F Guides and other 18F-branded documentation available on 18F Pages. It's structured like an 18F Guides guide, and it walks you through the process of creating and publishing an 18F Pages document based on the same theme. The template is derived from CFPB/DOCter. It uses Jekyll as the rendering engine. Create a new guide/document To get started on a new guide (or other document based on this theme), follow the \"Getting started\" instructions in the 18F/guides-template GitHub repository to create a local clone of this template. Once you've created a clone, click the Add a New Page entry in the table of contents to begin the rest of the steps. Update an existing guide/document Note: You need to do this only if your existing guide or document is not already using the guides_style_18f gem or if it does not have an 18f-pages branch. Add the guides_style_18f gem to your guide's Gemfile, if it's not already present. You may also wish to copy the ./go script from the template if your document doesn't already have one. To receive layout updates, as well as any new styles or scripts associated with them, you will need to run ./go update_theme. Or — if you aren't using a ./go script — you can run bundle update --source guides_style_18f manually.) If your repository already has a gh-pages branch, you can create an 18f-pages branch from it by running these commands: $ git checkout -b 18f-pages gh-pages $ git push origin 18f-pages Follow the instructions in Update the Config File to update your _config.yml accordingly. You may also need to consult the GitHub Setup and Post Your Guide chapters to ensure your guide is correctly published to pages.18f.gov and linked from the main 18F Guides site."},{"title":"Interoperability (APIs)","url":"/interoperability/","tags":[],"body":""},{"title":"Security","url":"/security/","tags":[],"body":""},{"title":"Authentication","url":"/security/authentication/","tags":[],"body":""},{"title":"Encryption","url":"/security/encryption/","tags":[],"body":""},{"title":"Hosting","url":"/security/hosting/","tags":[],"body":""},{"title":"Relevant Laws","url":"/security/relevant-laws/","tags":[],"body":""},{"title":"Third-Party Services and Social Media","url":"/third-party-services-and-social-media/","tags":[],"body":""},{"title":"User-Centered Design","url":"/user-centered-design/","tags":[],"body":"There's a reason we put this one first. Context You may find yourself in a position where you, in your public-oriented wisdom, realize that you may need to go forward and commence a technology project. If so - and this may sound intuitive but it's unbelievably crucial to actually do it - the first thing you need to do is talk to the people who are going to use or be impacted by the technology. You are really smart. You know your department/division/agency/office/program and the citizens it serves really well. Of course you do. But even you, a smart, inspiring public servant, are making assumptions about how your department/division/agency/office/program and the citizens it serves operate that do not jive with reality. It's not your fault - it's inherent. You may think that anything you might uncover by asking your potential users would be puny, insignificant details. But sometimes asking someone how they would like to interact with a system is enough to reframe the conversation on what really matters. Your project may not need to be as big as you thought. Context: Horse/Barn Scenario If you've already gone to RFP on this and haven't built in any language on user-centered or user-oriented design, that's fine. All this is new stuff to State Government. Tool: ODE Eval Member If you have a member of ODE on your evaluation committee, then they should be aware enough to at least evaluate vendors on how user-centric their solutions are. Tool: A User Lens in Evaluations If not, then go for it: read RFP responses in the light of: \"Was this solution designed to solve real user needs? Does this vendor indicate that their solution is the offshoot of really knowing how to solve my users' problems?\" Caveat: Because of our Division of Purchases regulations and the associated State procurement laws, and the particular language of the RFP you've put out, it may not be possible for you to use this particular lens in your evaluation. In general, though, most RFPs have a \"Capabilities of the Offeror\" or an \"Overall Response Quality\" section. It is the opinion of ODE that in some cases (all situations are different), it may be justifiable to incorporate this user-centricity lens to your personal or team evaluation of an RFP response. Check with the Division of Purchases before you do anything crazy. Context: I'm writing an RFP right now. Tools"}]}